tutorials/solution-time/SIPM-IP/threeCavity/momPred/caseD/constant/solidT/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0 1 0)
    (1 1 0)
    (1 1.2 0)
    ( 0 1.2 0)
    ( 0 1 0.1)
    (1 1 0.1)
    (1 1.2 0.1)
    ( 0 1.2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        
	type 		directMappedWall;        
        sampleMode      nearestPatchFace;
        sampleRegion    cavityR;
        samplePatch     topWall;
        offset          (0 0 0);
        zone            bottomZone;
        master          off;
        bridgeOverlap   off;   
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type 		directMappedWall;        
        sampleMode      nearestPatchFace;
        sampleRegion    cavityT;
        samplePatch     bottomWall;
        offset          (0 0 0);
        zone            topZone;
        master          off;
        bridgeOverlap   off;   
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
	type 		patch;        
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type 		patch;        
	faces  
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
